hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mipi_dsi_regs.h
/*
 * CRC_RX_EN (RW)
 *
 * enable the crc reception and error reporting
 */
#define MIPI_DSI_PCKHDL_CFG_CRC_RX_EN_MASK (0x10U)
#define MIPI_DSI_PCKHDL_CFG_CRC_RX_EN_SHIFT (4U)
#define MIPI_DSI_PCKHDL_CFG_CRC_RX_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_PCKHDL_CFG_CRC_RX_EN_SHIFT) & MIPI_DSI_PCKHDL_CFG_CRC_RX_EN_MASK)
#define MIPI_DSI_PCKHDL_CFG_CRC_RX_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_PCKHDL_CFG_CRC_RX_EN_MASK) >> MIPI_DSI_PCKHDL_CFG_CRC_RX_EN_SHIFT)

/*
 * ECC_RX_EN (RW)
 *
 * enable the ecc reception error correction and reporting
 */
#define MIPI_DSI_PCKHDL_CFG_ECC_RX_EN_MASK (0x8U)
#define MIPI_DSI_PCKHDL_CFG_ECC_RX_EN_SHIFT (3U)
#define MIPI_DSI_PCKHDL_CFG_ECC_RX_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_PCKHDL_CFG_ECC_RX_EN_SHIFT) & MIPI_DSI_PCKHDL_CFG_ECC_RX_EN_MASK)
#define MIPI_DSI_PCKHDL_CFG_ECC_RX_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_PCKHDL_CFG_ECC_RX_EN_MASK) >> MIPI_DSI_PCKHDL_CFG_ECC_RX_EN_SHIFT)

/*
 * BTA_EN (RW)
 *
 * enable the bus turn-around request
 */
#define MIPI_DSI_PCKHDL_CFG_BTA_EN_MASK (0x4U)
#define MIPI_DSI_PCKHDL_CFG_BTA_EN_SHIFT (2U)
#define MIPI_DSI_PCKHDL_CFG_BTA_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_PCKHDL_CFG_BTA_EN_SHIFT) & MIPI_DSI_PCKHDL_CFG_BTA_EN_MASK)
#define MIPI_DSI_PCKHDL_CFG_BTA_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_PCKHDL_CFG_BTA_EN_MASK) >> MIPI_DSI_PCKHDL_CFG_BTA_EN_SHIFT)

/*
 * EOTP_RX_EN (RW)
 *
 * enable the EoTp reception
 */
#define MIPI_DSI_PCKHDL_CFG_EOTP_RX_EN_MASK (0x2U)
#define MIPI_DSI_PCKHDL_CFG_EOTP_RX_EN_SHIFT (1U)
#define MIPI_DSI_PCKHDL_CFG_EOTP_RX_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_PCKHDL_CFG_EOTP_RX_EN_SHIFT) & MIPI_DSI_PCKHDL_CFG_EOTP_RX_EN_MASK)
#define MIPI_DSI_PCKHDL_CFG_EOTP_RX_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_PCKHDL_CFG_EOTP_RX_EN_MASK) >> MIPI_DSI_PCKHDL_CFG_EOTP_RX_EN_SHIFT)

/*
 * EOTP_TX_EN (RW)
 *
 * enable the EoTp transmission in high-speed
 */
#define MIPI_DSI_PCKHDL_CFG_EOTP_TX_EN_MASK (0x1U)
#define MIPI_DSI_PCKHDL_CFG_EOTP_TX_EN_SHIFT (0U)
#define MIPI_DSI_PCKHDL_CFG_EOTP_TX_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_PCKHDL_CFG_EOTP_TX_EN_SHIFT) & MIPI_DSI_PCKHDL_CFG_EOTP_TX_EN_MASK)
#define MIPI_DSI_PCKHDL_CFG_EOTP_TX_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_PCKHDL_CFG_EOTP_TX_EN_MASK) >> MIPI_DSI_PCKHDL_CFG_EOTP_TX_EN_SHIFT)

/* Bitfield definition for register: GEN_VCID */
/*
 * GEN_VCID_TX_AUTO (RW)
 *
 * indicates the generic interface virtual channel identification where generic packet is automatically generated and transmitted
 */
#define MIPI_DSI_GEN_VCID_GEN_VCID_TX_AUTO_MASK (0x30000UL)
#define MIPI_DSI_GEN_VCID_GEN_VCID_TX_AUTO_SHIFT (16U)
#define MIPI_DSI_GEN_VCID_GEN_VCID_TX_AUTO_SET(x) (((uint32_t)(x) << MIPI_DSI_GEN_VCID_GEN_VCID_TX_AUTO_SHIFT) & MIPI_DSI_GEN_VCID_GEN_VCID_TX_AUTO_MASK)
#define MIPI_DSI_GEN_VCID_GEN_VCID_TX_AUTO_GET(x) (((uint32_t)(x) & MIPI_DSI_GEN_VCID_GEN_VCID_TX_AUTO_MASK) >> MIPI_DSI_GEN_VCID_GEN_VCID_TX_AUTO_SHIFT)

/*
 * GEN_VCID_TEAR_AUTO (RW)
 *
 * indicates the virtual channel identification for tear effect by hardware
 */
#define MIPI_DSI_GEN_VCID_GEN_VCID_TEAR_AUTO_MASK (0x300U)
#define MIPI_DSI_GEN_VCID_GEN_VCID_TEAR_AUTO_SHIFT (8U)
#define MIPI_DSI_GEN_VCID_GEN_VCID_TEAR_AUTO_SET(x) (((uint32_t)(x) << MIPI_DSI_GEN_VCID_GEN_VCID_TEAR_AUTO_SHIFT) & MIPI_DSI_GEN_VCID_GEN_VCID_TEAR_AUTO_MASK)
#define MIPI_DSI_GEN_VCID_GEN_VCID_TEAR_AUTO_GET(x) (((uint32_t)(x) & MIPI_DSI_GEN_VCID_GEN_VCID_TEAR_AUTO_MASK) >> MIPI_DSI_GEN_VCID_GEN_VCID_TEAR_AUTO_SHIFT)

/*
 * GEN_VCID_RX (RW)
 *
 * indicates the generic interface read-back virtual channel identication
 */
#define MIPI_DSI_GEN_VCID_GEN_VCID_RX_MASK (0x3U)
#define MIPI_DSI_GEN_VCID_GEN_VCID_RX_SHIFT (0U)
#define MIPI_DSI_GEN_VCID_GEN_VCID_RX_SET(x) (((uint32_t)(x) << MIPI_DSI_GEN_VCID_GEN_VCID_RX_SHIFT) & MIPI_DSI_GEN_VCID_GEN_VCID_RX_MASK)
#define MIPI_DSI_GEN_VCID_GEN_VCID_RX_GET(x) (((uint32_t)(x) & MIPI_DSI_GEN_VCID_GEN_VCID_RX_MASK) >> MIPI_DSI_GEN_VCID_GEN_VCID_RX_SHIFT)

/* Bitfield definition for register: MODE_CFG */
/*
 * CMD_VIDEO_MODE (RW)
 *
 * 0x0: video mode
 * 0x1: command mode
 */
#define MIPI_DSI_MODE_CFG_CMD_VIDEO_MODE_MASK (0x1U)
#define MIPI_DSI_MODE_CFG_CMD_VIDEO_MODE_SHIFT (0U)
#define MIPI_DSI_MODE_CFG_CMD_VIDEO_MODE_SET(x) (((uint32_t)(x) << MIPI_DSI_MODE_CFG_CMD_VIDEO_MODE_SHIFT) & MIPI_DSI_MODE_CFG_CMD_VIDEO_MODE_MASK)
#define MIPI_DSI_MODE_CFG_CMD_VIDEO_MODE_GET(x) (((uint32_t)(x) & MIPI_DSI_MODE_CFG_CMD_VIDEO_MODE_MASK) >> MIPI_DSI_MODE_CFG_CMD_VIDEO_MODE_SHIFT)

/* Bitfield definition for register: VID_MODE_CFG */
/*
 * VPG_ORIENTATION (RW)
 *
 * indicates the color bar orientation :
 * 0x0: vertical mode
 * 0x1: horizontal mode
 */
#define MIPI_DSI_VID_MODE_CFG_VPG_ORIENTATION_MASK (0x1000000UL)
#define MIPI_DSI_VID_MODE_CFG_VPG_ORIENTATION_SHIFT (24U)
#define MIPI_DSI_VID_MODE_CFG_VPG_ORIENTATION_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_VPG_ORIENTATION_SHIFT) & MIPI_DSI_VID_MODE_CFG_VPG_ORIENTATION_MASK)
#define MIPI_DSI_VID_MODE_CFG_VPG_ORIENTATION_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_VPG_ORIENTATION_MASK) >> MIPI_DSI_VID_MODE_CFG_VPG_ORIENTATION_SHIFT)

/*
 * VPG_MODE (RW)
 *
 * 0x0: colorbar
 * 0x1: berpattern, vertical only
 */
#define MIPI_DSI_VID_MODE_CFG_VPG_MODE_MASK (0x100000UL)
#define MIPI_DSI_VID_MODE_CFG_VPG_MODE_SHIFT (20U)
#define MIPI_DSI_VID_MODE_CFG_VPG_MODE_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_VPG_MODE_SHIFT) & MIPI_DSI_VID_MODE_CFG_VPG_MODE_MASK)
#define MIPI_DSI_VID_MODE_CFG_VPG_MODE_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_VPG_MODE_MASK) >> MIPI_DSI_VID_MODE_CFG_VPG_MODE_SHIFT)

/*
 * VPG_EN (RW)
 *
 * enable video mode pattern generator
 */
#define MIPI_DSI_VID_MODE_CFG_VPG_EN_MASK (0x10000UL)
#define MIPI_DSI_VID_MODE_CFG_VPG_EN_SHIFT (16U)
#define MIPI_DSI_VID_MODE_CFG_VPG_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_VPG_EN_SHIFT) & MIPI_DSI_VID_MODE_CFG_VPG_EN_MASK)
#define MIPI_DSI_VID_MODE_CFG_VPG_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_VPG_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_VPG_EN_SHIFT)

