hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mipi_dsi_regs.h
/*
 * LP_CMD_EN (RW)
 *
 * enable command transmission only in low-power mode
 */
#define MIPI_DSI_VID_MODE_CFG_LP_CMD_EN_MASK (0x8000U)
#define MIPI_DSI_VID_MODE_CFG_LP_CMD_EN_SHIFT (15U)
#define MIPI_DSI_VID_MODE_CFG_LP_CMD_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_LP_CMD_EN_SHIFT) & MIPI_DSI_VID_MODE_CFG_LP_CMD_EN_MASK)
#define MIPI_DSI_VID_MODE_CFG_LP_CMD_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_LP_CMD_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_LP_CMD_EN_SHIFT)

/*
 * FRAME_BTA_ACK_EN (RW)
 *
 * enable the request for an acknowledge response at the end of a frame
 */
#define MIPI_DSI_VID_MODE_CFG_FRAME_BTA_ACK_EN_MASK (0x4000U)
#define MIPI_DSI_VID_MODE_CFG_FRAME_BTA_ACK_EN_SHIFT (14U)
#define MIPI_DSI_VID_MODE_CFG_FRAME_BTA_ACK_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_FRAME_BTA_ACK_EN_SHIFT) & MIPI_DSI_VID_MODE_CFG_FRAME_BTA_ACK_EN_MASK)
#define MIPI_DSI_VID_MODE_CFG_FRAME_BTA_ACK_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_FRAME_BTA_ACK_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_FRAME_BTA_ACK_EN_SHIFT)

/*
 * LP_HFP_EN (RW)
 *
 * enable the return to low-power inside the HFP period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_LP_HFP_EN_MASK (0x2000U)
#define MIPI_DSI_VID_MODE_CFG_LP_HFP_EN_SHIFT (13U)
#define MIPI_DSI_VID_MODE_CFG_LP_HFP_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_LP_HFP_EN_SHIFT) & MIPI_DSI_VID_MODE_CFG_LP_HFP_EN_MASK)
#define MIPI_DSI_VID_MODE_CFG_LP_HFP_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_LP_HFP_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_LP_HFP_EN_SHIFT)

/*
 * LP_HBP_EN (RW)
 *
 * enable the return to low-power inside the HBP period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_LP_HBP_EN_MASK (0x1000U)
#define MIPI_DSI_VID_MODE_CFG_LP_HBP_EN_SHIFT (12U)
#define MIPI_DSI_VID_MODE_CFG_LP_HBP_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_LP_HBP_EN_SHIFT) & MIPI_DSI_VID_MODE_CFG_LP_HBP_EN_MASK)
#define MIPI_DSI_VID_MODE_CFG_LP_HBP_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_LP_HBP_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_LP_HBP_EN_SHIFT)

/*
 * LP_VACT_EN (RW)
 *
 * enable the return to low-power inside the VACT period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_LP_VACT_EN_MASK (0x800U)
#define MIPI_DSI_VID_MODE_CFG_LP_VACT_EN_SHIFT (11U)
#define MIPI_DSI_VID_MODE_CFG_LP_VACT_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_LP_VACT_EN_SHIFT) & MIPI_DSI_VID_MODE_CFG_LP_VACT_EN_MASK)
#define MIPI_DSI_VID_MODE_CFG_LP_VACT_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_LP_VACT_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_LP_VACT_EN_SHIFT)

/*
 * LP_VFP_EN (RW)
 *
 * enable the return to low-power inside the VFP period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_LP_VFP_EN_MASK (0x400U)
#define MIPI_DSI_VID_MODE_CFG_LP_VFP_EN_SHIFT (10U)
#define MIPI_DSI_VID_MODE_CFG_LP_VFP_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_LP_VFP_EN_SHIFT) & MIPI_DSI_VID_MODE_CFG_LP_VFP_EN_MASK)
#define MIPI_DSI_VID_MODE_CFG_LP_VFP_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_LP_VFP_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_LP_VFP_EN_SHIFT)

/*
 * LP_VBP_EN (RW)
 *
 * enable the return to low-power inside the VBP period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_LP_VBP_EN_MASK (0x200U)
#define MIPI_DSI_VID_MODE_CFG_LP_VBP_EN_SHIFT (9U)
#define MIPI_DSI_VID_MODE_CFG_LP_VBP_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_LP_VBP_EN_SHIFT) & MIPI_DSI_VID_MODE_CFG_LP_VBP_EN_MASK)
#define MIPI_DSI_VID_MODE_CFG_LP_VBP_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_LP_VBP_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_LP_VBP_EN_SHIFT)

/*
 * LP_VSA_EN (RW)
 *
 * enable the return to low-power inside the VSA period when timing allows
 */
#define MIPI_DSI_VID_MODE_CFG_LP_VSA_EN_MASK (0x100U)
#define MIPI_DSI_VID_MODE_CFG_LP_VSA_EN_SHIFT (8U)
#define MIPI_DSI_VID_MODE_CFG_LP_VSA_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_LP_VSA_EN_SHIFT) & MIPI_DSI_VID_MODE_CFG_LP_VSA_EN_MASK)
#define MIPI_DSI_VID_MODE_CFG_LP_VSA_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_LP_VSA_EN_MASK) >> MIPI_DSI_VID_MODE_CFG_LP_VSA_EN_SHIFT)

/*
 * VID_MODE_TYPE (RW)
 *
 * indicates the video mode transmission type
 */
#define MIPI_DSI_VID_MODE_CFG_VID_MODE_TYPE_MASK (0x3U)
#define MIPI_DSI_VID_MODE_CFG_VID_MODE_TYPE_SHIFT (0U)
#define MIPI_DSI_VID_MODE_CFG_VID_MODE_TYPE_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_MODE_CFG_VID_MODE_TYPE_SHIFT) & MIPI_DSI_VID_MODE_CFG_VID_MODE_TYPE_MASK)
#define MIPI_DSI_VID_MODE_CFG_VID_MODE_TYPE_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_MODE_CFG_VID_MODE_TYPE_MASK) >> MIPI_DSI_VID_MODE_CFG_VID_MODE_TYPE_SHIFT)

/* Bitfield definition for register: VID_PKT_SIZE */
/*
 * VID_PKT_SIZE (RW)
 *
 * configures the number of pixels in a single video packet
 */
#define MIPI_DSI_VID_PKT_SIZE_VID_PKT_SIZE_MASK (0x3FFFU)
#define MIPI_DSI_VID_PKT_SIZE_VID_PKT_SIZE_SHIFT (0U)
#define MIPI_DSI_VID_PKT_SIZE_VID_PKT_SIZE_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_PKT_SIZE_VID_PKT_SIZE_SHIFT) & MIPI_DSI_VID_PKT_SIZE_VID_PKT_SIZE_MASK)
#define MIPI_DSI_VID_PKT_SIZE_VID_PKT_SIZE_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_PKT_SIZE_VID_PKT_SIZE_MASK) >> MIPI_DSI_VID_PKT_SIZE_VID_PKT_SIZE_SHIFT)

/* Bitfield definition for register: VID_NUM_CHUNKS */
/*
 * VID_NUM_CHUNKS (RW)
 *
 * configures the number of chunks to be transmitted a line period
 */
#define MIPI_DSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_MASK (0x1FFFU)
#define MIPI_DSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_SHIFT (0U)
#define MIPI_DSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_SHIFT) & MIPI_DSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_MASK)
#define MIPI_DSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_MASK) >> MIPI_DSI_VID_NUM_CHUNKS_VID_NUM_CHUNKS_SHIFT)

/* Bitfield definition for register: VID_NULL_SIZE */
/*
 * VID_NULL_SIZE (RW)
 *
 * configures the number of bytes inside a null packet
 */
#define MIPI_DSI_VID_NULL_SIZE_VID_NULL_SIZE_MASK (0x1FFFU)
#define MIPI_DSI_VID_NULL_SIZE_VID_NULL_SIZE_SHIFT (0U)
#define MIPI_DSI_VID_NULL_SIZE_VID_NULL_SIZE_SET(x) (((uint32_t)(x) << MIPI_DSI_VID_NULL_SIZE_VID_NULL_SIZE_SHIFT) & MIPI_DSI_VID_NULL_SIZE_VID_NULL_SIZE_MASK)
#define MIPI_DSI_VID_NULL_SIZE_VID_NULL_SIZE_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_NULL_SIZE_VID_NULL_SIZE_MASK) >> MIPI_DSI_VID_NULL_SIZE_VID_NULL_SIZE_SHIFT)

