hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mipi_dsi_regs.h
/*
 * DCS_SW_1P_TX (RW)
 *
 * This bit configures the DCS short write packet with one parameter command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_MASK (0x20000UL)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_SHIFT (17U)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_DCS_SW_1P_TX_SHIFT)

/*
 * DCS_SW_0P_TX (RW)
 *
 * This bit configures the DCS short write packet with zero parameter command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_0P_TX_MASK (0x10000UL)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_0P_TX_SHIFT (16U)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_0P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_DCS_SW_0P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_DCS_SW_0P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_DCS_SW_0P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_DCS_SW_0P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_DCS_SW_0P_TX_SHIFT)

/*
 * GEN_LW_TX (RW)
 *
 * This bit configures the Generic long write packet command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_GEN_LW_TX_MASK (0x4000U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_LW_TX_SHIFT (14U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_LW_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_GEN_LW_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_GEN_LW_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_GEN_LW_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_GEN_LW_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_GEN_LW_TX_SHIFT)

/*
 * GEN_SR_2P_TX (RW)
 *
 * This bit configures the Generic short read packet with two parameters command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_2P_TX_MASK (0x2000U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_2P_TX_SHIFT (13U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_2P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_GEN_SR_2P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_GEN_SR_2P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_2P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_GEN_SR_2P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_GEN_SR_2P_TX_SHIFT)

/*
 * GEN_SR_1P_TX (RW)
 *
 * This bit configures the Generic short read packet with two parameters command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_1P_TX_MASK (0x1000U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_1P_TX_SHIFT (12U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_1P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_GEN_SR_1P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_GEN_SR_1P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_1P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_GEN_SR_1P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_GEN_SR_1P_TX_SHIFT)

/*
 * GEN_SR_0P_TX (RW)
 *
 * This bit configures the Generic short read packet with two parameters command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_0P_TX_MASK (0x800U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_0P_TX_SHIFT (11U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_0P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_GEN_SR_0P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_GEN_SR_0P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SR_0P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_GEN_SR_0P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_GEN_SR_0P_TX_SHIFT)

/*
 * GEN_SW_2P_TX (RW)
 *
 * This bit configures the Generic short read packet with two parameters command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_2P_TX_MASK (0x400U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_2P_TX_SHIFT (10U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_2P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_GEN_SW_2P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_GEN_SW_2P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_2P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_GEN_SW_2P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_GEN_SW_2P_TX_SHIFT)

/*
 * GEN_SW_1P_TX (RW)
 *
 * This bit configures the Generic short read packet with two parameters command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_1P_TX_MASK (0x200U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_1P_TX_SHIFT (9U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_1P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_GEN_SW_1P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_GEN_SW_1P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_1P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_GEN_SW_1P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_GEN_SW_1P_TX_SHIFT)

/*
 * GEN_SW_0P_TX (RW)
 *
 * This bit configures the Generic short read packet with two parameters command transmission type:
 * 0x0 (HIGHSPEED): Transition type is High Speed
 * 0x1 (LOWPOWER): Transition type is Low Power
 */
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_0P_TX_MASK (0x100U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_0P_TX_SHIFT (8U)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_0P_TX_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_GEN_SW_0P_TX_SHIFT) & MIPI_DSI_CMD_MODE_CFG_GEN_SW_0P_TX_MASK)
#define MIPI_DSI_CMD_MODE_CFG_GEN_SW_0P_TX_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_GEN_SW_0P_TX_MASK) >> MIPI_DSI_CMD_MODE_CFG_GEN_SW_0P_TX_SHIFT)

/*
 * ACK_RQST_EN (RW)
 *
 * When set to 1, this bit enables the acknowledge request after each packet transmission.
 */
#define MIPI_DSI_CMD_MODE_CFG_ACK_RQST_EN_MASK (0x2U)
#define MIPI_DSI_CMD_MODE_CFG_ACK_RQST_EN_SHIFT (1U)
#define MIPI_DSI_CMD_MODE_CFG_ACK_RQST_EN_SET(x) (((uint32_t)(x) << MIPI_DSI_CMD_MODE_CFG_ACK_RQST_EN_SHIFT) & MIPI_DSI_CMD_MODE_CFG_ACK_RQST_EN_MASK)
#define MIPI_DSI_CMD_MODE_CFG_ACK_RQST_EN_GET(x) (((uint32_t)(x) & MIPI_DSI_CMD_MODE_CFG_ACK_RQST_EN_MASK) >> MIPI_DSI_CMD_MODE_CFG_ACK_RQST_EN_SHIFT)

