hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mipi_dsi_regs.h
/*
 * PHY_ULPSACTIVENOT2LANE (R)
 *
 * This bit indicates the status of ulpsactivenot2lane D-PHY
 * signa
 */
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT2LANE_MASK (0x400U)
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT2LANE_SHIFT (10U)
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT2LANE_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT2LANE_MASK) >> MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT2LANE_SHIFT)

/*
 * PHY_STOPSTATE2LANE (R)
 *
 * This bit indicates the status of phystopstate2lane D-PHY
 * signal
 */
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATE2LANE_MASK (0x200U)
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATE2LANE_SHIFT (9U)
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATE2LANE_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_STOPSTATE2LANE_MASK) >> MIPI_DSI_PHY_STATUS_PHY_STOPSTATE2LANE_SHIFT)

/*
 * PHY_ULPSACTIVENOT1LANE (R)
 *
 * This bit indicates the status of ulpsactivenot1lane D-PHY
 * signal
 */
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT1LANE_MASK (0x100U)
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT1LANE_SHIFT (8U)
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT1LANE_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT1LANE_MASK) >> MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT1LANE_SHIFT)

/*
 * PHY_STOPSTATE1LANE (R)
 *
 * This bit indicates the status of phystopstate1lane D-PHY
 * signal
 */
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATE1LANE_MASK (0x80U)
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATE1LANE_SHIFT (7U)
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATE1LANE_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_STOPSTATE1LANE_MASK) >> MIPI_DSI_PHY_STATUS_PHY_STOPSTATE1LANE_SHIFT)

/*
 * PHY_RXULPSESC0LANE (R)
 *
 * This bit indicates the status of rxulpsesc0lane D-PHY signa
 */
#define MIPI_DSI_PHY_STATUS_PHY_RXULPSESC0LANE_MASK (0x40U)
#define MIPI_DSI_PHY_STATUS_PHY_RXULPSESC0LANE_SHIFT (6U)
#define MIPI_DSI_PHY_STATUS_PHY_RXULPSESC0LANE_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_RXULPSESC0LANE_MASK) >> MIPI_DSI_PHY_STATUS_PHY_RXULPSESC0LANE_SHIFT)

/*
 * PHY_ULPSACTIVENOT0LANE (R)
 *
 * This bit indicates the status of ulpsactivenot0lane D-PHY
 * signal
 */
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT0LANE_MASK (0x20U)
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT0LANE_SHIFT (5U)
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT0LANE_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT0LANE_MASK) >> MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOT0LANE_SHIFT)

/*
 * PHY_STOPSTATE0LANE (R)
 *
 * This bit indicates the status of phystopstate0lane D-PHY
 * signal
 */
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATE0LANE_MASK (0x10U)
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATE0LANE_SHIFT (4U)
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATE0LANE_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_STOPSTATE0LANE_MASK) >> MIPI_DSI_PHY_STATUS_PHY_STOPSTATE0LANE_SHIFT)

/*
 * PHY_ULPSACTIVENOTCLK (R)
 *
 * This bit indicates the status of phyulpsactivenotclk D-PHY
 * signal
 */
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOTCLK_MASK (0x8U)
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOTCLK_SHIFT (3U)
#define MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOTCLK_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOTCLK_MASK) >> MIPI_DSI_PHY_STATUS_PHY_ULPSACTIVENOTCLK_SHIFT)

/*
 * PHY_STOPSTATECLKLANE (R)
 *
 * This bit indicates the status of phystopstateclklane D-PHY
 * signal
 */
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATECLKLANE_MASK (0x4U)
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATECLKLANE_SHIFT (2U)
#define MIPI_DSI_PHY_STATUS_PHY_STOPSTATECLKLANE_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_STOPSTATECLKLANE_MASK) >> MIPI_DSI_PHY_STATUS_PHY_STOPSTATECLKLANE_SHIFT)

/*
 * PHY_DIRECTION (R)
 *
 * This bit indicates the status of phydirection D-PHY signal
 */
#define MIPI_DSI_PHY_STATUS_PHY_DIRECTION_MASK (0x2U)
#define MIPI_DSI_PHY_STATUS_PHY_DIRECTION_SHIFT (1U)
#define MIPI_DSI_PHY_STATUS_PHY_DIRECTION_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_DIRECTION_MASK) >> MIPI_DSI_PHY_STATUS_PHY_DIRECTION_SHIFT)

/*
 * PHY_LOCK (R)
 *
 * This bit indicates the status of phylock D-PHY signal
 */
#define MIPI_DSI_PHY_STATUS_PHY_LOCK_MASK (0x1U)
#define MIPI_DSI_PHY_STATUS_PHY_LOCK_SHIFT (0U)
#define MIPI_DSI_PHY_STATUS_PHY_LOCK_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_STATUS_PHY_LOCK_MASK) >> MIPI_DSI_PHY_STATUS_PHY_LOCK_SHIFT)

/* Bitfield definition for register: PHY_TST_CTRL0 */
/*
 * PHY_TESTCLK (RW)
 *
 * reserve
 */
#define MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLK_MASK (0x2U)
#define MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLK_SHIFT (1U)
#define MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLK_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLK_SHIFT) & MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLK_MASK)
#define MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLK_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLK_MASK) >> MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLK_SHIFT)

/*
 * PHY_TESTCLR (RW)
 *
 * reserve
 */
#define MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLR_MASK (0x1U)
#define MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLR_SHIFT (0U)
#define MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLR_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLR_SHIFT) & MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLR_MASK)
#define MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLR_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLR_MASK) >> MIPI_DSI_PHY_TST_CTRL0_PHY_TESTCLR_SHIFT)

/* Bitfield definition for register: PHY_TST_CTRL1 */
/*
 * PHY_TESTEN (RW)
 *
 * reserve
 */
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTEN_MASK (0x10000UL)
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTEN_SHIFT (16U)
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTEN_SET(x) (((uint32_t)(x) << MIPI_DSI_PHY_TST_CTRL1_PHY_TESTEN_SHIFT) & MIPI_DSI_PHY_TST_CTRL1_PHY_TESTEN_MASK)
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTEN_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TST_CTRL1_PHY_TESTEN_MASK) >> MIPI_DSI_PHY_TST_CTRL1_PHY_TESTEN_SHIFT)

/*
 * PHY_TESTDOUT (R)
 *
 * reserve
 */
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDOUT_MASK (0xFF00U)
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDOUT_SHIFT (8U)
#define MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDOUT_GET(x) (((uint32_t)(x) & MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDOUT_MASK) >> MIPI_DSI_PHY_TST_CTRL1_PHY_TESTDOUT_SHIFT)

