hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mipi_dsi_regs.h
/*
 * ACK_WITH_ERR4 (R)
 *
 * retrives the LP transmit sync error from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR4_MASK (0x10U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR4_SHIFT (4U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR4_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR4_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR4_SHIFT)

/*
 * ACK_WITH_ERR3 (R)
 *
 * retrives the Escap mode entry command error from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR3_MASK (0x8U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR3_SHIFT (3U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR3_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR3_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR3_SHIFT)

/*
 * ACK_WITH_ERR2 (R)
 *
 * retrives the EoT sync error from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR2_MASK (0x4U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR2_SHIFT (2U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR2_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR2_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR2_SHIFT)

/*
 * ACK_WITH_ERR1 (R)
 *
 * retrives the SoT sync error from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR1_MASK (0x2U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR1_SHIFT (1U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR1_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR1_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR1_SHIFT)

/*
 * ACK_WITH_ERR0 (R)
 *
 * retrives the SoT serror from the acknowledge error report
 */
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR0_MASK (0x1U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR0_SHIFT (0U)
#define MIPI_DSI_INT_ST0_ACK_WITH_ERR0_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST0_ACK_WITH_ERR0_MASK) >> MIPI_DSI_INT_ST0_ACK_WITH_ERR0_SHIFT)

/* Bitfield definition for register: INT_ST1 */
/*
 * TEAR_REQUEST_ERR (R)
 *
 * indicates tear_request has occurred but tear effect is not active in dsi host and device
 */
#define MIPI_DSI_INT_ST1_TEAR_REQUEST_ERR_MASK (0x100000UL)
#define MIPI_DSI_INT_ST1_TEAR_REQUEST_ERR_SHIFT (20U)
#define MIPI_DSI_INT_ST1_TEAR_REQUEST_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_TEAR_REQUEST_ERR_MASK) >> MIPI_DSI_INT_ST1_TEAR_REQUEST_ERR_SHIFT)

/*
 * DPI_BUFF_PLD_UNDER (R)
 *
 * indicates an underflow when reading payload to build dsi packet for video mode
 */
#define MIPI_DSI_INT_ST1_DPI_BUFF_PLD_UNDER_MASK (0x80000UL)
#define MIPI_DSI_INT_ST1_DPI_BUFF_PLD_UNDER_SHIFT (19U)
#define MIPI_DSI_INT_ST1_DPI_BUFF_PLD_UNDER_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_DPI_BUFF_PLD_UNDER_MASK) >> MIPI_DSI_INT_ST1_DPI_BUFF_PLD_UNDER_SHIFT)

/*
 * GEN_PLD_RECEV_ERR (R)
 *
 * indicates that during a generic interface packet read back, the payload FIFO full
 */
#define MIPI_DSI_INT_ST1_GEN_PLD_RECEV_ERR_MASK (0x1000U)
#define MIPI_DSI_INT_ST1_GEN_PLD_RECEV_ERR_SHIFT (12U)
#define MIPI_DSI_INT_ST1_GEN_PLD_RECEV_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_GEN_PLD_RECEV_ERR_MASK) >> MIPI_DSI_INT_ST1_GEN_PLD_RECEV_ERR_SHIFT)

/*
 * GEN_PLD_RD_ERR (R)
 *
 * indicates that during a DCS read data, the payload FIFO becomes empty
 */
#define MIPI_DSI_INT_ST1_GEN_PLD_RD_ERR_MASK (0x800U)
#define MIPI_DSI_INT_ST1_GEN_PLD_RD_ERR_SHIFT (11U)
#define MIPI_DSI_INT_ST1_GEN_PLD_RD_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_GEN_PLD_RD_ERR_MASK) >> MIPI_DSI_INT_ST1_GEN_PLD_RD_ERR_SHIFT)

/*
 * GEN_PLD_SEND_ERR (R)
 *
 * indicates the payload FIFO become empty when packet build
 */
#define MIPI_DSI_INT_ST1_GEN_PLD_SEND_ERR_MASK (0x400U)
#define MIPI_DSI_INT_ST1_GEN_PLD_SEND_ERR_SHIFT (10U)
#define MIPI_DSI_INT_ST1_GEN_PLD_SEND_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_GEN_PLD_SEND_ERR_MASK) >> MIPI_DSI_INT_ST1_GEN_PLD_SEND_ERR_SHIFT)

/*
 * GEN_PLD_WR_ERR (R)
 *
 * indicates the system tried to write a payload and FIFO is full
 */
#define MIPI_DSI_INT_ST1_GEN_PLD_WR_ERR_MASK (0x200U)
#define MIPI_DSI_INT_ST1_GEN_PLD_WR_ERR_SHIFT (9U)
#define MIPI_DSI_INT_ST1_GEN_PLD_WR_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_GEN_PLD_WR_ERR_MASK) >> MIPI_DSI_INT_ST1_GEN_PLD_WR_ERR_SHIFT)

/*
 * GEN_CMD_WR_ERR (R)
 *
 * indicates the system tried to write a command and FIFO is full
 */
#define MIPI_DSI_INT_ST1_GEN_CMD_WR_ERR_MASK (0x100U)
#define MIPI_DSI_INT_ST1_GEN_CMD_WR_ERR_SHIFT (8U)
#define MIPI_DSI_INT_ST1_GEN_CMD_WR_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_GEN_CMD_WR_ERR_MASK) >> MIPI_DSI_INT_ST1_GEN_CMD_WR_ERR_SHIFT)

/*
 * DPI_BPLD_WR_ERR (R)
 *
 * indicates the payload FIFO is full during a DPI pixel line storage
 */
#define MIPI_DSI_INT_ST1_DPI_BPLD_WR_ERR_MASK (0x80U)
#define MIPI_DSI_INT_ST1_DPI_BPLD_WR_ERR_SHIFT (7U)
#define MIPI_DSI_INT_ST1_DPI_BPLD_WR_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_DPI_BPLD_WR_ERR_MASK) >> MIPI_DSI_INT_ST1_DPI_BPLD_WR_ERR_SHIFT)

/*
 * EOPT_ERR (R)
 *
 * indicates that the EoTp packet has not been received at the end of the incoming peripheral transmission
 */
#define MIPI_DSI_INT_ST1_EOPT_ERR_MASK (0x40U)
#define MIPI_DSI_INT_ST1_EOPT_ERR_SHIFT (6U)
#define MIPI_DSI_INT_ST1_EOPT_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_EOPT_ERR_MASK) >> MIPI_DSI_INT_ST1_EOPT_ERR_SHIFT)

/*
 * PKT_SIZE_ERR (R)
 *
 * indicates that the packet size error has been detected during the packet reception
 */
#define MIPI_DSI_INT_ST1_PKT_SIZE_ERR_MASK (0x20U)
#define MIPI_DSI_INT_ST1_PKT_SIZE_ERR_SHIFT (5U)
#define MIPI_DSI_INT_ST1_PKT_SIZE_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_PKT_SIZE_ERR_MASK) >> MIPI_DSI_INT_ST1_PKT_SIZE_ERR_SHIFT)

/*
 * CRC_ERR (R)
 *
 * indicates that the CRC error has been detected in the reveived packet payload
 */
#define MIPI_DSI_INT_ST1_CRC_ERR_MASK (0x10U)
#define MIPI_DSI_INT_ST1_CRC_ERR_SHIFT (4U)
#define MIPI_DSI_INT_ST1_CRC_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_CRC_ERR_MASK) >> MIPI_DSI_INT_ST1_CRC_ERR_SHIFT)

/*
 * ECC_MULTI_ERR (R)
 *
 * indicates that the ECC multiple error has been detected in a revieved packet
 */
#define MIPI_DSI_INT_ST1_ECC_MULTI_ERR_MASK (0x8U)
#define MIPI_DSI_INT_ST1_ECC_MULTI_ERR_SHIFT (3U)
#define MIPI_DSI_INT_ST1_ECC_MULTI_ERR_GET(x) (((uint32_t)(x) & MIPI_DSI_INT_ST1_ECC_MULTI_ERR_MASK) >> MIPI_DSI_INT_ST1_ECC_MULTI_ERR_SHIFT)

