hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/soc/ip/hpm_mipi_dsi_regs.h
/* Bitfield definition for register: VID_PKT_STATUS */
/*
 * DPI_BUFF_PLD_FULL (R)
 *
 * This bit indicates the full status of the payload internal buffer
 * for video Mode. This bit is set to 0 for command Mode
 */
#define MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_FULL_MASK (0x20000UL)
#define MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_FULL_SHIFT (17U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_FULL_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_FULL_MASK) >> MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_FULL_SHIFT)

/*
 * DPI_BUFF_PLD_EMPTY (R)
 *
 * This bit indicates the empty status of the payload internal
 * buffer for video Mode. This bit is set to 0 for command Mod
 */
#define MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_EMPTY_MASK (0x10000UL)
#define MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_EMPTY_SHIFT (16U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_EMPTY_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_EMPTY_MASK) >> MIPI_DSI_VID_PKT_STATUS_DPI_BUFF_PLD_EMPTY_SHIFT)

/*
 * DPI_PLD_W_FULL (R)
 *
 * This bit indicates the full status of write payload FIFO for
 * video Mode. This bit is set to 0 for command Mode
 */
#define MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_FULL_MASK (0x8U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_FULL_SHIFT (3U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_FULL_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_FULL_MASK) >> MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_FULL_SHIFT)

/*
 * DPI_PLD_W_EMPTY (R)
 *
 * This bit indicates the empty status of write payload FIFO for
 * video Mode. This bit is set to 0 for command Mode
 */
#define MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_EMPTY_MASK (0x4U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_EMPTY_SHIFT (2U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_EMPTY_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_EMPTY_MASK) >> MIPI_DSI_VID_PKT_STATUS_DPI_PLD_W_EMPTY_SHIFT)

/*
 * DPI_CMD_W_FULL (R)
 *
 * This bit indicates the full status of write command FIFO for
 * video Mode. This bit is set to 0 for command Mode
 */
#define MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_FULL_MASK (0x2U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_FULL_SHIFT (1U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_FULL_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_FULL_MASK) >> MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_FULL_SHIFT)

/*
 * DPI_CMD_W_EMPTY (R)
 *
 * This bit indicates the empty status of write command FIFO
 * for video Mode. This bit is set to 0 for command Mode
 */
#define MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_EMPTY_MASK (0x1U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_EMPTY_SHIFT (0U)
#define MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_EMPTY_GET(x) (((uint32_t)(x) & MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_EMPTY_MASK) >> MIPI_DSI_VID_PKT_STATUS_DPI_CMD_W_EMPTY_SHIFT)

/* Bitfield definition for register: SDF_3D_ACT */
/*
 * SEND_3D_CFG (R)
 *
 * When set, causes the next VSS packet to include 3D control
 * payload in every VSS packet.
 */
#define MIPI_DSI_SDF_3D_ACT_SEND_3D_CFG_MASK (0x10000UL)
#define MIPI_DSI_SDF_3D_ACT_SEND_3D_CFG_SHIFT (16U)
#define MIPI_DSI_SDF_3D_ACT_SEND_3D_CFG_GET(x) (((uint32_t)(x) & MIPI_DSI_SDF_3D_ACT_SEND_3D_CFG_MASK) >> MIPI_DSI_SDF_3D_ACT_SEND_3D_CFG_SHIFT)

/*
 * RIGHT_FIRST (R)
 *
 * This bit specifies the left/right order
 */
#define MIPI_DSI_SDF_3D_ACT_RIGHT_FIRST_MASK (0x20U)
#define MIPI_DSI_SDF_3D_ACT_RIGHT_FIRST_SHIFT (5U)
#define MIPI_DSI_SDF_3D_ACT_RIGHT_FIRST_GET(x) (((uint32_t)(x) & MIPI_DSI_SDF_3D_ACT_RIGHT_FIRST_MASK) >> MIPI_DSI_SDF_3D_ACT_RIGHT_FIRST_SHIFT)

/*
 * SECOND_VSYNC (R)
 *
 * This field specifies whether there is a second VSYNC pulse
 * between Left and Right Images, when 3D Image Format is
 * Frame-based
 */
#define MIPI_DSI_SDF_3D_ACT_SECOND_VSYNC_MASK (0x10U)
#define MIPI_DSI_SDF_3D_ACT_SECOND_VSYNC_SHIFT (4U)
#define MIPI_DSI_SDF_3D_ACT_SECOND_VSYNC_GET(x) (((uint32_t)(x) & MIPI_DSI_SDF_3D_ACT_SECOND_VSYNC_MASK) >> MIPI_DSI_SDF_3D_ACT_SECOND_VSYNC_SHIFT)

/*
 * FORMAT_3D (R)
 *
 * This field specifies 3D Image Format
 */
#define MIPI_DSI_SDF_3D_ACT_FORMAT_3D_MASK (0xCU)
#define MIPI_DSI_SDF_3D_ACT_FORMAT_3D_SHIFT (2U)
#define MIPI_DSI_SDF_3D_ACT_FORMAT_3D_GET(x) (((uint32_t)(x) & MIPI_DSI_SDF_3D_ACT_FORMAT_3D_MASK) >> MIPI_DSI_SDF_3D_ACT_FORMAT_3D_SHIFT)

/*
 * MODE_3D (R)
 *
 * This field specifies 3D Mode On/Off and Display Orientation
 */
#define MIPI_DSI_SDF_3D_ACT_MODE_3D_MASK (0x3U)
#define MIPI_DSI_SDF_3D_ACT_MODE_3D_SHIFT (0U)
#define MIPI_DSI_SDF_3D_ACT_MODE_3D_GET(x) (((uint32_t)(x) & MIPI_DSI_SDF_3D_ACT_MODE_3D_MASK) >> MIPI_DSI_SDF_3D_ACT_MODE_3D_SHIFT)




#endif /* HPM_MIPI_DSI_H */
